Use plant uml for ASM engine's flow and design
